In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
tempretures = pd.read_csv(r'E:\Notebook\single_temperature_dataset.csv')
tempretures

           date      city        country  avg_temp_c
0    2000-01-01    London             UK      12.074
1    2000-01-31  New York            USA      -0.714
2    2000-03-01    London             UK       7.986
3    2000-03-31      Xian          China       7.115
4    2000-04-30     Tokyo          Japan      29.439
..          ...       ...            ...         ...
295  2024-03-25    London             UK      10.597
296  2024-04-24   Abidjan  Côte D'Ivoire      17.050
297  2024-05-24     Tokyo          Japan      32.287
298  2024-06-23   Abidjan  Côte D'Ivoire      32.983
299  2024-07-23     Tokyo          Japan      17.669

[300 rows x 4 columns]

In [7]:
# Set the index of tempretures to city
temperatures_ind = tempretures.set_index("city")

# Look at temperatures_ind
print(temperatures_ind)

# Reset the temperatures_ind index, keeping its contents
print(temperatures_ind.reset_index())

# Reset the temperatures_ind index, dropping its contents
print(temperatures_ind.reset_index(drop = True))

                date        country  avg_temp_c
city
London    2000-01-01             UK      12.074
New York  2000-01-31            USA      -0.714
London    2000-03-01             UK       7.986
Xian      2000-03-31          China       7.115
Tokyo     2000-04-30          Japan      29.439
...              ...            ...         ...
London    2024-03-25             UK      10.597
Abidjan   2024-04-24  Côte D'Ivoire      17.050
Tokyo     2024-05-24          Japan      32.287
Abidjan   2024-06-23  Côte D'Ivoire      32.983
Tokyo     2024-07-23          Japan      17.669

[300 rows x 3 columns]
         city        date        country  avg_temp_c
0      London  2000-01-01             UK      12.074
1    New York  2000-01-31            USA      -0.714
2      London  2000-03-01             UK       7.986
3        Xian  2000-03-31          China       7.115
4       Tokyo  2000-04-30          Japan      29.439
..        ...         ...            ...         ...
295    London  2024-03-25             UK      10.597
296   Abidjan  2024-04-24  Côte D'Ivoire      17.050
297     Tokyo  2024-05-24          Japan      32.287
298   Abidjan  2024-06-23  Côte D'Ivoire      32.983
299     Tokyo  2024-07-23          Japan      17.669

[300 rows x 4 columns]
           date        country  avg_temp_c
0    2000-01-01             UK      12.074
1    2000-01-31            USA      -0.714
2    2000-03-01             UK       7.986
3    2000-03-31          China       7.115
4    2000-04-30          Japan      29.439
..          ...            ...         ...
295  2024-03-25             UK      10.597
296  2024-04-24  Côte D'Ivoire      17.050
297  2024-05-24          Japan      32.287
298  2024-06-23  Côte D'Ivoire      32.983
299  2024-07-23          Japan      17.669

[300 rows x 3 columns]